/*
 [26-Mar-21 10:46]

 Юлето къса листенца на маргаритка. Пропускайки първото листенце и късайки второто, Юлето продължава да пропуска и къса по едно листенце, докато накрая не остане само едно.
 Напишете програма, която по зададен брой листенца на маргаритката извежда кое ще е последното останало. Направете това по възможно най-оптимален начин.
 Пример: Ако маргаритка има 9 листенца, Юлето ще откъсне листенцата в следния ред: 2, 4, 6, 8, 1, 5, 9, 7, оставяйки 3-тото листенце последно.
*/

n,i=1;main(){scanf("%d",&n);while(n/i)i+=i;printf("%d",2*n-i+1);}
