/*
[21-Jun-21 10:21]

Брошура
Напишете на езика C или C++ програма, която по въведено от стандартния вход цяло положително число n
извежда на стандартния изход две редици от номера на страници, които показват как да се отпечата брошура
от n страници. По-точно редиците са такива, че се изпълнява следното.
Нека страниците с номера от едната редица се отпечатват по четири на лист от едната
му страна във вида
	а б
	в г
(редът на буквите показва реда на разполагане на страниците).
Обръщайки така получения напечатан сноп хартия, по същия начин страниците с номера от другата редица се
отпечатват на обратната страна на листовете. Сега, ако снопът хартия се разреже хоризонтално през средата
и горната половина обърнем върху долната, а после този по-дебел сноп прегънем вертикално през средата,
налагайки лявата половина върху дясната, получаваме отпечатък на брошурата: страниците са в нужния ред от 1 до n,
а (в зависимост от стойността на n) последните не повече от 7 страници могат да са празни.
В извежданите числови редици на празните страници трябва да отговарят нули вместо истински номера.
Номерата на онези страници, които трябва да бъдат отпечатани „с главата надолу“ (защото след срязването на снопа
се обръщат) се извеждат със знак минус.

Например за n = 8 програмата трябва да изведе
-5 -4 8 1
-3 -6 2 7

а за n = 19:
-13 -12 0 1 -15 -10 0 3 -17 -8 0 5
-7 -18 6 19 -9 -16 4 0 -11 -14 2 0
*/

// NoGolf

#include <stdio.h>

int n;

int page(int x){
	return (x > n || x < -n) ? 0:-x;
}

int main(){
	scanf("%d", &n);
	
	int p = n / 8;
	if (n % 8) p++;
	
	int m = p * 8;
	int h = p * 4;
	
	int i;
	for (i = 0; i < p; i++){
		printf("%d %d %d %d ", page(h+2*i+1)	// top left front
			, page(h-2*i)	// top right front
			, page(-m+2*i)	// bottom left front
			, 2*i+1);	// bottom right front
	}
	
	printf("\n");
	
	for (i = p-1; i >= 0; i--){
		printf("%d %d %d %d ", page(h-2*i-1)	// top left back
			, page(h+2*i+2)	// top right back
			, page(-2*i-2)	// bottom left back
			, page(-m+2*i+1));	// bottom right back
	}
	
	return 0;
}

// Golf

n;t(x){return x>n||x<-n?0:-x;}main(i,p,m,h){scanf("%d",&n);p=n/8+!!(n%8);m=p*8;h=p*4;
for(i=0;i<p;i++)printf("%d %d %d %d ",t(h+2*i+1),t(h-2*i),t(-m+2*i),2*i+1);printf("\n");
for(i=p-1;i>=0;i--)printf("%d %d %d %d ",t(h-2*i-1),t(h+2*i+2),t(-2*i-2),t(-m+2*i+1));}
