/*
[12-Jul-21 14:00]

Задача
Дадена е редица от числа, в която всяко се повтаря точно два пъти освен едно. Да се намери кое е уникалното число.
Решението трябва да е линейно и да ползва възможно най-малко памет.

Пример: 2, 1, 4, 4, 2
Изход: 1

Бонус: Всяко число се повтаря по 3 пъти освен едно.

Пример: 5, 4, 4, 2, 5, 5, 4
Изход: 2
*/

// Golf-2 (75 bytes)

a=0,x,n;main(){scanf("%d",&n);for(;n--;a^=x)scanf("%d",&x);printf("%d",a);}

// Golf-3 (102 bytes)

a=0,b=0,x,n;main(){scanf("%d",&n);for(;n--;b|=a&x,a^=x,x=a,a&=~b,b&=~x)scanf("%d",&x);printf("%d",a);}
