'''
[27-Sep-21 09:52]

Нека d(n) е най-малкото цяло положително число, чиито цифри в десетична бройна система имат сума n.
Например d(10) = 19.

Нека S(n) = Sum{i = 1..n, d(i)}.

Напишете програма, която по зададено k, (0 < k < 2^62) на стандартния вход, отпечатва S(k) по модул от 1 000 000 007 на стандартния изход.

    ********
    
[Примерно решение]

Лесно се съобразява, че d(n) има синтактичния вид xy, където x е n mod 9, а y е дума от n div 9 деветки.
Сега ако n има вида 9k + m при m < 9, то S(n) се състои от 1, 2, ... 9, 19, 29, ... 99, ..., 1 и (k-1 деветки), ..., 9 и (k-1) деветки, 1 и (k деветки), ..., m и (k деветки).
Тоест S(n) = 54*10^0 - 9 + ... + 54*10^(k-1) - 9 + ((1+m)*(2+m)/2 - 1)*10^k - m = (5 + (1+m)*(2+m)/2)*10^k - n - 6.

'''

n = int(input())
u, m = int(1e9 + 7), n % 9
print(((5 + (1 + m) * (2 + m) // 2) * pow(10, n//9, u) - n - 6) % u)